app/controllers/movies_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  ORDER BY created_at DESC  [["movie_id", 1]]
---
  def show
    @reviews = Review.where(movie_id: @movie.id).order("created_at DESC")

INSERT INTO "movies" ("title", "description", "movie_length", "director", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["movie_length", ""], ["director", ""], ["rating", ""], ["created_at", "2015-07-31 00:38:18.938759"], ["updated_at", "2015-07-31 00:38:18.938759"]]
---
  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "title" = ?, "description" = ?, "movie_length" = ?, "director" = ?, "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Buff"], ["description", "Buff"], ["movie_length", "Buff"], ["director", "Buff"], ["rating", "Buff"], ["updated_at", "2015-07-31 05:40:49.403658"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)