app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 4], ["comment", "hello"], ["user_id", 1], ["movie_id", 3], ["created_at", "2015-07-30 22:59:30.708172"], ["updated_at", "2015-07-30 22:59:30.708172"]]